# YOLOv12-seg-EMA 🚀, AGPL-3.0 license
# YOLOv12 实例分割 + EMA (Efficient Multi-Scale Attention)
# 在 backbone 的 A2C2f 之后插入 EMA 模块，增强多尺度特征提取
# 参考: FEI-YOLO (Agronomy 2024) - 大豆豆荚检测 mAP 提升 0.8%

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLOv12-turbo backbone + EMA
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]]  # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]]  # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]]        # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, EMA,   [512]]              # 7 ★ EMA after P4 A2C2f
  - [-1, 1, Conv,  [1024, 3, 2]]       # 8-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]
  - [-1, 1, EMA,   [1024]]             # 10 ★ EMA after P5 A2C2f

# YOLOv12-turbo head (索引已重新编号)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]          # cat backbone P4 (EMA output at 7)
  - [-1, 2, A2C2f, [512, False, -1]]   # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]          # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]]   # 16

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]         # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]]   # 19

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]         # cat head P5 (EMA output at 10)
  - [-1, 2, C3k2, [1024, True]]        # 22 (P5/32-large)

  - [[16, 19, 22], 1, Segment, [nc, 32, 256]]  # Segment(P3, P4, P5)
