# YOLOv12-seg-A2C2fEMASpatial 🚀, AGPL-3.0 license
# R5 实验：A2C2fEMASpatial = A2C2f + EMA(通道注意力) + SpatialAttention(空间注意力)
# 在 backbone 的 A2C2f 中依次嵌入 EMA + SpatialAttention，维度正交
# 层索引与 baseline 完全一致，参数增量 ~16K (EMA) + ~50 (SA)

# Parameters
nc: 80  # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLOv12-turbo backbone (A2C2f → A2C2fEMASpatial at P4/P5)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]]             # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]]      # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]]      # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]]            # 5-P4/16
  - [-1, 4, A2C2fEMASpatial, [512, True, 4]]   # 6 ★ EMA + SpatialAttention
  - [-1, 1, Conv,  [1024, 3, 2]]           # 7-P5/32
  - [-1, 4, A2C2fEMASpatial, [1024, True, 1]]  # 8 ★ EMA + SpatialAttention

# YOLOv12-turbo head (与 baseline 完全相同)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]              # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]]       # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]              # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]]       # 14

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]             # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]]       # 17

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]              # cat head P5
  - [-1, 2, C3k2, [1024, True]]            # 20 (P5/32-large)

  - [[14, 17, 20], 1, Segment, [nc, 32, 256]]  # Segment(P3, P4, P5)
