# YOLOv12-seg-A2C2fEMAGRN 🚀, AGPL-3.0 license
# A2C2fEMAGRN 融合模块：EMA(空间门控) + GRN(通道多样性正则化)
# EMA: ICASSP 2023 — 分组空间注意力
# GRN: ConvNeXt V2, CVPR 2023 — 全局 L2 范数通道归一化
# GRN 完全不含 sigmoid/tanh，γ/β 零初始化 → 训练初期恒等映射

# Parameters
nc: 80  # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLOv12-turbo backbone (A2C2f → A2C2fEMAGRN at P4/P5)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]]                # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]]         # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]]         # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]]               # 5-P4/16
  - [-1, 4, A2C2fEMAGRN, [512, True, 4]]      # 6 ★ EMA + GRN
  - [-1, 1, Conv,  [1024, 3, 2]]              # 7-P5/32
  - [-1, 4, A2C2fEMAGRN, [1024, True, 1]]     # 8 ★ EMA + GRN

# YOLOv12-turbo head (与 baseline 完全相同)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]                 # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]]          # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]                 # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]]          # 14

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]                # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]]          # 17

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]                 # cat head P5
  - [-1, 2, C3k2, [1024, True]]               # 20 (P5/32-large)

  - [[14, 17, 20], 1, Segment, [nc, 32, 256]] # Segment(P3, P4, P5)
